Repository: HotCakeX/Harden-Windows-Security
Catalog: AppControl Manager/Strings/*/Resources.resw
Source language: en_us
Languages: ar, de_de, el_gr, es, fr_fr, he_il, hi_in, ja_jp, ml_in, pl_pl, tr_tr

# UpdatePageSeeWhatsNewHyperLinkButton.AutomationProperties.HelpText
source: Opens the GitHub's releases page where you can find the full release notes for the available update.
ar: يفتح صفحة إصدارات GitHub حيث يمكنك العثور على ملاحظات الإصدار الكاملة للتحديث المتاح.
de_de: Öffnet die GitHub-Releases-Seite, auf der Sie die vollständigen Versionshinweise für das verfügbare Update finden.
el_gr: Ανοίγει τη σελίδα εκδόσεων του GitHub όπου μπορείτε να βρείτε τις πλήρεις σημειώσεις έκδοσης για τη διαθέσιμη ενημέρωση.
es: Abre la página de lanzamientos de GitHub donde puede encontrar las notas completas de la versión para la actualización disponible.
fr_fr: Ouvre la page des versions GitHub où vous pouvez trouver les notes de version complètes pour la mise à jour disponible.
he_il: פותח את עמוד ה-Releases של GitHub שבו תוכל למצוא את הערות השחרור המלאות עבור העדכון הקיים.
hi_in: GitHub के रिलीज़ पेज को खोलता है जहाँ आप उपलब्ध अपडेट के पूर्ण रिलीज़ नोट्स पा सकते हैं।
ja_jp: GitHubのリリースページを開き、利用可能なアップデートの完全なリリースノートを確認できます。
ml_in: ലഭ്യമായ അപ്‌ഡേറ്റിനായുള്ള പൂർണ്ണമായ റിലീസ് കുറിപ്പുകൾ നിങ്ങൾക്ക് കണ്ടെത്താൻ കഴിയുന്ന GitHub-ന്റെ റിലീസ് പേജ് തുറക്കുന്നു.
pl_pl: Otwiera stronę wydań GitHub, na której można znaleźć pełne informacje o wydaniu dostępnej aktualizacji.
tr_tr: Mevcut güncellemenin tam sürüm notlarını bulabileceğiniz GitHub'un sürümler sayfasını açar.

# CheckForUpdateSettingsCard.Description
source: Once the updates are downloaded and installed, the next time you open the AppControl Manager you will use the new version.
ar: بمجرد تنزيل التحديثات وتثبيتها، ستستخدم الإصدار الجديد في المرة التالية التي تفتح فيها مدير AppControl.
de_de: Sobald die Updates heruntergeladen und installiert sind, verwenden Sie beim nächsten Öffnen des AppControl Managers die neue Version.
el_gr: Μόλις οι ενημερώσεις κατεβούν και εγκατασταθούν, την επόμενη φορά που θα ανοίξετε τον AppControl Manager θα χρησιμοποιήσετε τη νέα έκδοση.
es: Una vez que las actualizaciones se descarguen e instalen, la próxima vez que abra AppControl Manager utilizará la nueva versión.
fr_fr: Une fois les mises à jour téléchargées et installées, la prochaine fois que vous ouvrirez AppControl Manager, vous utiliserez la nouvelle version.
he_il: לאחר שהעדכונים יורדו ויותקנו, בפעם הבאה שתפתח את AppControl Manager תשתמש בגרסה החדשה.
hi_in: एक बार अपडेट डाउनलोड और इन्स्टॉल हो जाने के बाद, अगली बार AppControl Manager खोलने पर आप नई संस्करण का उपयोग करेंगे।
ja_jp: 更新がダウンロードされてインストールされると、次回AppControl Managerを開いたときに新しいバージョンが使用されます。
ml_in: അപ്‌ഡേറ്റുകൾ ഡൗൺലോഡ് ചെയ്‌ത് ഇൻസ്റ്റാൾ ചെയ്‌തുകഴിഞ്ഞാൽ, അടുത്ത തവണ നിങ്ങൾ ആപ്പ്കൺട്രോൾ മാനേജർ തുറക്കുമ്പോൾ പുതിയ പതിപ്പ് ഉപയോഗിക്കും.
pl_pl: Po pobraniu i zainstalowaniu aktualizacji, przy następnym otwarciu Menedżera AppControl będziesz korzystać z nowej wersji.
tr_tr: Güncellemeler indirilip yüklendikten sonra AppControl Manager'ı bir sonraki açışınızda yeni sürümü kullanacaksınız.

# CheckForUpdateSettingsCard.Header
source: Check for AppControl Manager update
ar: التحقق من تحديث مدير AppControl
de_de: Nach AppControl-Manager-Update suchen
el_gr: Έλεγχος για ενημέρωση του AppControl Manager
es: Buscar actualización de AppControl Manager
fr_fr: Vérifier la mise à jour d'AppControl Manager
he_il: בדוק עדכון ל-AppControl Manager
hi_in: AppControl Manager अपडेट जांचें
ja_jp: AppControl Managerの更新を確認
ml_in: ആപ്പ്കൺട്രോൾ മാനേജർ അപ്‌ഡേറ്റിനായി പരിശോധിക്കുക
pl_pl: Sprawdź aktualizację Menedżera AppControl
tr_tr: AppControl Manager güncellemesini kontrol edin

# CheckForUpdateSettingsCard.ToolTipService.ToolTip
source: Once the updates are downloaded and installed, the next time you open the AppControl Manager you will use the new version.
ar: بمجرد تنزيل التحديثات وتثبيتها، ستستخدم الإصدار الجديد في المرة التالية التي تفتح فيها مدير AppControl.
de_de: Sobald die Updates heruntergeladen und installiert sind, verwenden Sie beim nächsten Öffnen des AppControl Managers die neue Version.
el_gr: Μόλις οι ενημερώσεις κατεβούν και εγκατασταθούν, την επόμενη φορά που θα ανοίξετε τον AppControl Manager θα χρησιμοποιήσετε τη νέα έκδοση.
es: Una vez que las actualizaciones se descarguen e instalen, la próxima vez que abra AppControl Manager utilizará la nueva versión.
fr_fr: Une fois les mises à jour téléchargées et installées, la prochaine fois que vous ouvrirez AppControl Manager, vous utiliserez la nouvelle version.
he_il: לאחר שהעדכונים יורדו ויותקנו, בפעם הבאה שתפתח את AppControl Manager תשתמש בגרסה החדשה.
hi_in: एक बार अपडेट डाउनलोड और इन्स्टॉल हो जाने के बाद, अगली बार AppControl Manager खोलने पर आप नई संस्करण का उपयोग करेंगे।
ja_jp: 更新がダウンロードされてインストールされると、次回AppControl Managerを開いたときに新しいバージョンが使用されます。
ml_in: അപ്‌ഡേറ്റുകൾ ഡൗൺലോഡ് ചെയ്‌ത് ഇൻസ്റ്റാൾ ചെയ്‌തുകഴിഞ്ഞാൽ, അടുത്ത തവണ നിങ്ങൾ ആപ്പ്കൺട്രോൾ മാനേജർ തുറക്കുമ്പോൾ പുതിയ പതിപ്പ് ഉപയോഗിക്കും.
pl_pl: Po pobraniu i zainstalowaniu aktualizacji, przy następnym otwarciu Menedżera AppControl będziesz korzystać z nowej wersji.
tr_tr: Güncellemeler indirilip yüklendikten sonra AppControl Manager'ı bir sonraki açışınızda yeni sürümü kullanacaksınız.

# CheckForUpdateSettingsCard.AutomationProperties.HelpText
source: Once the updates are downloaded and installed, the next time you open the AppControl Manager you will use the new version.
ar: بمجرد تنزيل التحديثات وتثبيتها، ستستخدم الإصدار الجديد في المرة التالية التي تفتح فيها مدير AppControl.
de_de: Sobald die Updates heruntergeladen und installiert sind, verwenden Sie beim nächsten Öffnen des AppControl Managers die neue Version.
el_gr: Μόλις οι ενημερώσεις κατεβούν και εγκατασταθούν, την επόμενη φορά που θα ανοίξετε τον AppControl Manager θα χρησιμοποιήσετε τη νέα έκδοση.
es: Una vez que las actualizaciones se descarguen e instalen, la próxima vez que abra AppControl Manager utilizará la nueva versión.
fr_fr: Une fois les mises à jour téléchargées et installées, la prochaine fois que vous ouvrirez AppControl Manager, vous utiliserez la nouvelle version.
he_il: לאחר שהעדכונים יורדו ויותקנו, בפעם הבאה שתפתח את AppControl Manager תשתמש בגרסה החדשה.
hi_in: एक बार अपडेट डाउनलोड और इन्स्टॉल हो जाने के बाद, अगली बार AppControl Manager खोलने पर आप नई संस्करण का उपयोग करेंगे।
ja_jp: 更新がダウンロードされてインストールされると、次回AppControl Managerを開いたときに新しいバージョンが使用されます。
ml_in: അപ്‌ഡേറ്റുകൾ ഡൗൺലോഡ് ചെയ്‌ത് ഇൻസ്റ്റാൾ ചെയ്‌തുകഴിഞ്ഞാൽ, അടുത്ത തവണ നിങ്ങൾ ആപ്പ്കൺട്രോൾ മാനേജർ തുറക്കുമ്പോൾ പുതിയ പതിപ്പ് ഉപയോഗിക്കും.
pl_pl: Po pobraniu i zainstalowaniu aktualizacji, przy następnym otwarciu Menedżera AppControl będziesz korzystać z nowej wersji.
tr_tr: Güncellemeler indirilip yüklendikten sonra AppControl Manager'ı bir sonraki açışınızda yeni sürümü kullanacaksınız.

# AutoUpdateCheckSettingsCard.Description
source: Automatically checks for update when the app launches and notify you if a new version is available so you can use this page to install it.
ar: يتحقق تلقائيًا من وجود تحديث عند تشغيل التطبيق ويعلمك إذا كان هناك إصدار جديد متاح حتى تتمكن من استخدام هذه الصفحة لتثبيته.
de_de: Prüft beim Start der App automatisch auf Updates und benachrichtigt Sie, wenn eine neue Version verfügbar ist, damit Sie diese Seite zum Installieren verwenden können.
el_gr: Ελέγχει αυτόματα για ενημέρωση όταν η εφαρμογή εκκινείται και σας ειδοποιεί εάν είναι διαθέσιμη μια νέα έκδοση ώστε να μπορείτε να χρησιμοποιήσετε αυτήν τη σελίδα για να την εγκαταστήσετε.
es: Busca automáticamente actualizaciones cuando se inicia la aplicación y le notifica si hay una nueva versión disponible para que pueda usar esta página para instalarla.
fr_fr: Vérifie automatiquement les mises à jour au lancement de l'application et vous avertit si une nouvelle version est disponible afin que vous puissiez utiliser cette page pour l'installer.
he_il: בודק באופן אוטומטי עדכונים בעת הפעלת האפליקציה ומודיע לך אם גרסה חדשה זמינה, כך שתוכל להשתמש בדף זה כדי להתקין אותה.
hi_in: ऐप लॉन्च होने पर स्वचालित रूप से अपडेट जांचता है और आपको सूचित करता है यदि नया संस्करण उपलब्ध हो ताकि आप इसे इस पेज से इन्स्टॉल कर सकें।
ja_jp: アプリ起動時に自動的に更新をチェックし、新しいバージョンが利用可能な場合は通知します。このページからインストールできます。
ml_in: ആപ്പ് ലോഞ്ച് ചെയ്യുമ്പോൾ യാന്ത്രികമായി അപ്‌ഡേറ്റിനായി പരിശോധിക്കുകയും പുതിയ പതിപ്പ് ലഭ്യമാണെങ്കിൽ നിങ്ങളെ അറിയിക്കുകയും ചെയ്യും, അതുവഴി നിങ്ങൾക്ക് ഈ പേജ് ഉപയോഗിച്ച് അത് ഇൻസ്റ്റാൾ ചെയ്യാൻ കഴിയും.
pl_pl: Automatycznie sprawdza aktualizacje po uruchomieniu aplikacji i powiadamia o dostępności nowej wersji, aby można było ją zainstalować na tej stronie.
tr_tr: Uygulama başlatıldığında güncellemeyi otomatik olarak kontrol eder ve yeni bir sürümün mevcut olup olmadığını size bildirir, böylece yüklemek için bu sayfayı kullanabilirsiniz.

# AutoUpdateCheckSettingsCard.Header
source: Auto Update Check
ar: التحقق التلقائي من التحديث
de_de: Automatische Update-Prüfung
el_gr: Αυτόματος Έλεγχος Ενημέρωσης
es: Comprobación Automática de Actualizaciones
fr_fr: Vérification Auto des Mises à Jour
he_il: בדיקה אוטומטית לעדכונים
hi_in: स्वचालित अपडेट जांच
ja_jp: 自動更新チェック
ml_in: യാന്ത്രിക അപ്‌ഡേറ്റ് പരിശോധന
pl_pl: Automatyczne sprawdzanie aktualizacji
tr_tr: Otomatik Güncelleme Kontrolü

# AutoUpdateCheckSettingsCard.ToolTipService.ToolTip
source: Automatically checks for update when the app launches and notify you if a new version is available so you can use this page to install it.
ar: يتحقق تلقائيًا من وجود تحديث عند تشغيل التطبيق ويعلمك إذا كان هناك إصدار جديد متاح حتى تتمكن من استخدام هذه الصفحة لتثبيته.
de_de: Prüft beim Start der App automatisch auf Updates und benachrichtigt Sie, wenn eine neue Version verfügbar ist, damit Sie diese Seite zum Installieren verwenden können.
el_gr: Ελέγχει αυτόματα για ενημέρωση όταν η εφαρμογή εκκινείται και σας ειδοποιεί εάν είναι διαθέσιμη μια νέα έκδοση ώστε να μπορείτε να χρησιμοποιήσετε αυτήν τη σελίδα για να την εγκαταστήσετε.
es: Busca automáticamente actualizaciones cuando se inicia la aplicación y le notifica si hay una nueva versión disponible para que pueda usar esta página para instalarla.
fr_fr: Vérifie automatiquement les mises à jour au lancement de l'application et vous avertit si une nouvelle version est disponible afin que vous puissiez utiliser cette page pour l'installer.
he_il: בודק באופן אוטומטי עדכונים בעת הפעלת האפליקציה ומודיע לך אם גרסה חדשה זמינה, כך שתוכל להשתמש בדף זה כדי להתקין אותה.
hi_in: ऐप लॉन्च होने पर स्वचालित रूप से अपडेट जांचता है और आपको सूचित करता है यदि नया संस्करण उपलब्ध हो ताकि आप इसे इस पेज से इन्स्टॉल कर सकें।
ja_jp: アプリ起動時に自動的に更新をチェックし、新しいバージョンが利用可能な場合は通知します。このページからインストールできます。
ml_in: ആപ്പ് ലോഞ്ച് ചെയ്യുമ്പോൾ യാന്ത്രികമായി അപ്‌ഡേറ്റിനായി പരിശോധിക്കുകയും പുതിയ പതിപ്പ് ലഭ്യമാണെങ്കിൽ നിങ്ങളെ അറിയിക്കുകയും ചെയ്യും, അതുവഴി നിങ്ങൾക്ക് ഈ പേജ് ഉപയോഗിച്ച് അത് ഇൻസ്റ്റാൾ ചെയ്യാൻ കഴിയും.
pl_pl: Automatycznie sprawdza aktualizacje po uruchomieniu aplikacji i powiadamia o dostępności nowej wersji, aby można było ją zainstalować na tej stronie.
tr_tr: Uygulama başlatıldığında güncellemeyi otomatik olarak kontrol eder ve yeni bir sürümün mevcut olup olmadığını size bildirir, böylece yüklemek için bu sayfayı kullanabilirsiniz.

# AutoUpdateCheckSettingsCard.AutomationProperties.HelpText
source: Automatically checks for update when the app launches and notify you if a new version is available so you can use this page to install it.
ar: يتحقق تلقائيًا من وجود تحديث عند تشغيل التطبيق ويعلمك إذا كان هناك إصدار جديد متاح حتى تتمكن من استخدام هذه الصفحة لتثبيته.
de_de: Prüft beim Start der App automatisch auf Updates und benachrichtigt Sie, wenn eine neue Version verfügbar ist, damit Sie diese Seite zum Installieren verwenden können.
el_gr: Ελέγχει αυτόματα για ενημέρωση όταν η εφαρμογή εκκινείται και σας ειδοποιεί εάν είναι διαθέσιμη μια νέα έκδοση ώστε να μπορείτε να χρησιμοποιήσετε αυτήν τη σελίδα για να την εγκαταστήσετε.
es: Busca automáticamente actualizaciones cuando se inicia la aplicación y le notifica si hay una nueva versión disponible para que pueda usar esta página para instalarla.
fr_fr: Vérifie automatiquement les mises à jour au lancement de l'application et vous avertit si une nouvelle version est disponible afin que vous puissiez utiliser cette page pour l'installer.
he_il: בודק באופן אוטומטי עדכונים בעת הפעלת האפליקציה ומודיע לך אם גרסה חדשה זמינה, כך שתוכל להשתמש בדף זה כדי להתקין אותה.
hi_in: ऐप लॉन्च होने पर स्वचालित रूप से अपडेट जांचता है और आपको सूचित करता है यदि नया संस्करण उपलब्ध हो ताकि आप इसे इस पेज से इन्स्टॉल कर सकें।
ja_jp: アプリ起動時に自動的に更新をチェックし、新しいバージョンが利用可能な場合は通知します。このページからインストールできます。
ml_in: ആപ്പ് ലോഞ്ച് ചെയ്യുമ്പോൾ യാന്ത്രികമായി അപ്‌ഡേറ്റിനായി പരിശോധിക്കുകയും പുതിയ പതിപ്പ് ലഭ്യമാണെങ്കിൽ നിങ്ങളെ അറിയിക്കുകയും ചെയ്യും, അതുവഴി നിങ്ങൾക്ക് ഈ പേജ് ഉപയോഗിച്ച് അത് ഇൻസ്റ്റാൾ ചെയ്യാൻ കഴിയും.
pl_pl: Automatycznie sprawdza aktualizacje po uruchomieniu aplikacji i powiadamia o dostępności nowej wersji, aby można było ją zainstalować na tej stronie.
tr_tr: Uygulama başlatıldığında güncellemeyi otomatik olarak kontrol eder ve yeni bir sürümün mevcut olup olmadığını size bildirir, böylece yüklemek için bu sayfayı kullanabilirsiniz.

# HardenedUpdateProcedureSettingsCard.Description
source: When this option is enabled, the temporary private key of the on-device generated certificate will be linked to the user's account, requiring confirmation of prompts before it can be used for signing.
ar: عند تمكين هذا الخيار، سيتم ربط المفتاح الخاص المؤقت للشهادة التي تم إنشاؤها على الجهاز بحساب المستخدم، مما يتطلب تأكيد المطالبات قبل استخدامه للتوقيع.
de_de: Wenn diese Option aktiviert ist, wird der temporäre private Schlüssel des auf dem Gerät generierten Zertifikats mit dem Benutzerkonto verknüpft; die Bestätigung von Eingabeaufforderungen ist erforderlich, bevor er zum Signieren verwendet werden kann.
el_gr: Όταν αυτή η επιλογή είναι ενεργοποιημένη, το προσωρινό ιδιωτικό κλειδί του πιστοποιητικού που δημιουργήθηκε στη συσκευή θα συνδεθεί με τον λογαριασμό του χρήστη, απαιτώντας επιβεβαίωση προτροπών πριν μπορέσει να χρησιμοποιηθεί για υπογραφή.
es: Cuando esta opción está habilitada, la clave privada temporal del certificado generado en el dispositivo se vinculará a la cuenta del usuario, requiriendo la confirmación de avisos antes de que pueda usarse para firmar.
fr_fr: Lorsque cette option est activée, la clé privée temporaire du certificat généré sur l'appareil sera liée au compte de l'utilisateur, nécessitant une confirmation des invites avant de pouvoir être utilisée pour la signature.
he_il: כאשר אפשרות זו מופעלת, המפתח הפרטי הזמני של התעודה שנוצרה במכשיר יקושר לחשבון המשתמש, ויידרש אישור בהנחיות לפני שניתן יהיה להשתמש בו לחתימה.
hi_in: जब यह विकल्प सक्षम होगा, तो ऑन-डिवाइस जनरेट किए गए प्रमाणपत्र की अस्थायी निजी कुंजी उपयोगकर्ता के खाते से लिंक हो जाएगी, और इसे साइनिंग के लिए उपयोग करने से पहले संकेतों की पुष्टि आवश्यक होगी।
ja_jp: このオプションが有効な場合、デバイス上で生成された証明書の一時的な秘密キーがユーザーアカウントにリンクされ、署名に使用する前に確認プロンプトが必要になります。
ml_in: ഈ ഓപ്ഷൻ പ്രവർത്തനക്ഷമമാക്കിയിരിക്കുമ്പോൾ, ഉപകരണത്തിൽ സൃഷ്ടിച്ച സർട്ടിഫിക്കറ്റിന്റെ താൽക്കാലിക സ്വകാര്യ കീ ഉപയോക്താവിന്റെ അക്കൗണ്ടുമായി ബന്ധിപ്പിക്കും, ഒപ്പിടുന്നതിന് മുമ്പ് പ്രോംപ്റ്റുകളുടെ സ്ഥിരീകരണം ആവശ്യമാണ്.
pl_pl: Gdy ta opcja jest włączona, tymczasowy klucz prywatny certyfikatu wygenerowanego na urządzeniu zostanie powiązany z kontem użytkownika, co będzie wymagało potwierdzenia monitów przed jego użyciem do podpisywania.
tr_tr: Bu seçenek etkinleştirildiğinde, cihazda oluşturulan sertifikanın geçici özel anahtarı kullanıcının hesabına bağlanacak ve imzalama için kullanılmadan önce istemlerin onaylanması gerekecektir.

# HardenedUpdateProcedureSettingsCard.Header
source: Hardened Update Procedure
ar: إجراء تحديث مُحصّن
de_de: Gehärtetes Updateverfahren
el_gr: Ενισχυμένη Διαδικασία Ενημέρωσης
es: Procedimiento de Actualización Reforzado
fr_fr: Procédure de Mise à Jour Renforcée
he_il: נוהל עדכון מחוזק
hi_in: कठोर अपडेट प्रक्रिया
ja_jp: 強化された更新手順
ml_in: കർശനമാക്കിയ അപ്‌ഡേറ്റ് നടപടിക്രമം
pl_pl: Wzmocniona procedura aktualizacji
tr_tr: Sertleştirilmiş Güncelleme Prosedürü

# HardenedUpdateProcedureSettingsCard.ToolTipService.ToolTip
source: When this option is enabled, the temporary private key of the on-device generated certificate will be linked to the user's account, requiring confirmation of prompts before it can be used for signing.
ar: عند تمكين هذا الخيار، سيتم ربط المفتاح الخاص المؤقت للشهادة التي تم إنشاؤها على الجهاز بحساب المستخدم، مما يتطلب تأكيد المطالبات قبل استخدامه للتوقيع.
de_de: Wenn diese Option aktiviert ist, wird der temporäre private Schlüssel des auf dem Gerät generierten Zertifikats mit dem Benutzerkonto verknüpft; die Bestätigung von Eingabeaufforderungen ist erforderlich, bevor er zum Signieren verwendet werden kann.
el_gr: Όταν αυτή η επιλογή είναι ενεργοποιημένη, το προσωρινό ιδιωτικό κλειδί του πιστοποιητικού που δημιουργήθηκε στη συσκευή θα συνδεθεί με τον λογαριασμό του χρήστη, απαιτώντας επιβεβαίωση προτροπών πριν μπορέσει να χρησιμοποιηθεί για υπογραφή.
es: Cuando esta opción está habilitada, la clave privada temporal del certificado generado en el dispositivo se vinculará a la cuenta del usuario, requiriendo la confirmación de avisos antes de que pueda usarse para firmar.
fr_fr: Lorsque cette option est activée, la clé privée temporaire du certificat généré sur l'appareil sera liée au compte de l'utilisateur, nécessitant une confirmation des invites avant de pouvoir être utilisée pour la signature.
he_il: כאשר אפשרות זו מופעלת, המפתח הפרטי הזמני של התעודה שנוצרה במכשיר יקושר לחשבון המשתמש, ויידרש אישור בהנחיות לפני שניתן יהיה להשתמש בו לחתימה.
hi_in: जब यह विकल्प सक्षम होगा, तो ऑन-डिवाइस जनरेट किए गए प्रमाणपत्र की अस्थायी निजी कुंजी उपयोगकर्ता के खाते से लिंक हो जाएगी, और इसे साइनिंग के लिए उपयोग करने से पहले संकेतों की पुष्टि आवश्यक होगी।
ja_jp: このオプションが有効な場合、デバイス上で生成された証明書の一時的な秘密キーがユーザーアカウントにリンクされ、署名に使用する前に確認プロンプトが必要になります。
ml_in: ഈ ഓപ്ഷൻ പ്രവർത്തനക്ഷമമാക്കിയിരിക്കുമ്പോൾ, ഉപകരണത്തിൽ സൃഷ്ടിച്ച സർട്ടിഫിക്കറ്റിന്റെ താൽക്കാലിക സ്വകാര്യ കീ ഉപയോക്താവിന്റെ അക്കൗണ്ടുമായി ബന്ധിപ്പിക്കും, ഒപ്പിടുന്നതിന് മുമ്പ് പ്രോംപ്റ്റുകളുടെ സ്ഥിരീകരണം ആവശ്യമാണ്.
pl_pl: Gdy ta opcja jest włączona, tymczasowy klucz prywatny certyfikatu wygenerowanego na urządzeniu zostanie powiązany z kontem użytkownika, co będzie wymagało potwierdzenia monitów przed jego użyciem do podpisywania.
tr_tr: Bu seçenek etkinleştirildiğinde, cihazda oluşturulan sertifikanın geçici özel anahtarı kullanıcının hesabına bağlanacak ve imzalama için kullanılmadan önce istemlerin onaylanması gerekecektir.

# HardenedUpdateProcedureSettingsCard.AutomationProperties.HelpText
source: When this option is enabled, the temporary private key of the on-device generated certificate will be linked to the user's account, requiring confirmation of prompts before it can be used for signing.
ar: عند تمكين هذا الخيار، سيتم ربط المفتاح الخاص المؤقت للشهادة التي تم إنشاؤها على الجهاز بحساب المستخدم، مما يتطلب تأكيد المطالبات قبل استخدامه للتوقيع.
de_de: Wenn diese Option aktiviert ist, wird der temporäre private Schlüssel des auf dem Gerät generierten Zertifikats mit dem Benutzerkonto verknüpft; die Bestätigung von Eingabeaufforderungen ist erforderlich, bevor er zum Signieren verwendet werden kann.
el_gr: Όταν αυτή η επιλογή είναι ενεργοποιημένη, το προσωρινό ιδιωτικό κλειδί του πιστοποιητικού που δημιουργήθηκε στη συσκευή θα συνδεθεί με τον λογαριασμό του χρήστη, απαιτώντας επιβεβαίωση προτροπών πριν μπορέσει να χρησιμοποιηθεί για υπογραφή.
es: Cuando esta opción está habilitada, la clave privada temporal del certificado generado en el dispositivo se vinculará a la cuenta del usuario, requiriendo la confirmación de avisos antes de que pueda usarse para firmar.
fr_fr: Lorsque cette option est activée, la clé privée temporaire du certificat généré sur l'appareil sera liée au compte de l'utilisateur, nécessitant une confirmation des invites avant de pouvoir être utilisée pour la signature.
he_il: כאשר אפשרות זו מופעלת, המפתח הפרטי הזמני של התעודה שנוצרה במכשיר יקושר לחשבון המשתמש, ויידרש אישור בהנחיות לפני שניתן יהיה להשתמש בו לחתימה.
hi_in: जब यह विकल्प सक्षम होगा, तो ऑन-डिवाइस जनरेट किए गए प्रमाणपत्र की अस्थायी निजी कुंजी उपयोगकर्ता के खाते से लिंक हो जाएगी, और इसे साइनिंग के लिए उपयोग करने से पहले संकेतों की पुष्टि आवश्यक होगी।
ja_jp: このオプションが有効な場合、デバイス上で生成された証明書の一時的な秘密キーがユーザーアカウントにリンクされ、署名に使用する前に確認プロンプトが必要になります。
ml_in: ഈ ഓപ്ഷൻ പ്രവർത്തനക്ഷമമാക്കിയിരിക്കുമ്പോൾ, ഉപകരണത്തിൽ സൃഷ്ടിച്ച സർട്ടിഫിക്കറ്റിന്റെ താൽക്കാലിക സ്വകാര്യ കീ ഉപയോക്താവിന്റെ അക്കൗണ്ടുമായി ബന്ധിപ്പിക്കും, ഒപ്പിടുന്നതിന് മുമ്പ് പ്രോംപ്റ്റുകളുടെ സ്ഥിരീകരണം ആവശ്യമാണ്.
pl_pl: Gdy ta opcja jest włączona, tymczasowy klucz prywatny certyfikatu wygenerowanego na urządzeniu zostanie powiązany z kontem użytkownika, co będzie wymagało potwierdzenia monitów przed jego użyciem do podpisywania.
tr_tr: Bu seçenek etkinleştirildiğinde, cihazda oluşturulan sertifikanın geçici özel anahtarı kullanıcının hesabına bağlanacak ve imzalama için kullanılmadan önce istemlerin onaylanması gerekecektir.

# UpdatePageCheckForUpdateButton.ToolTipService.ToolTip
source: Will download and install the latest version from the GitHub repository. The time it takes depends on your network connection. Approximate download size is 65 MB.
ar: سيتم تنزيل أحدث إصدار وتثبيته من مستودع GitHub. يعتمد الوقت المستغرق على اتصال الشبكة لديك. حجم التنزيل التقريبي هو 65 ميجابايت.
de_de: Lädt die neueste Version aus dem GitHub-Repository herunter und installiert sie. Die Dauer hängt von Ihrer Netzwerkverbindung ab. Ungefähre Downloadgröße: 65 MB.
el_gr: Θα κατεβάσει και θα εγκαταστήσει την τελευταία έκδοση από το αποθετήριο GitHub. Ο χρόνος που απαιτείται εξαρτάται από τη σύνδεσή σας στο δίκτυο. Το κατά προσέγγιση μέγεθος λήψης είναι 65 MB.
es: Descargará e instalará la última versión del repositorio de GitHub. El tiempo que tarde dependerá de su conexión de red. El tamaño aproximado de la descarga es de 65 MB.
fr_fr: Téléchargera et installera la dernière version depuis le dépôt GitHub. Le temps nécessaire dépend de votre connexion réseau. La taille approximative du téléchargement est de 65 Mo.
he_il: יוריד ויתקין את הגרסה העדכנית ביותר ממאגר GitHub. משך הפעולה תלוי בחיבור הרשת שלך. הגודל המשוער להורדה הוא 65 MB.
hi_in: GitHub रिपॉज़िटरी से नवीनतम संस्करण डाउनलोड और इन्स्टॉल करेगा। समय आपके नेटवर्क कनेक्शन पर निर्भर करता है। अनुमानित डाउनलोड आकार 65 MB है।
ja_jp: GitHubリポジトリから最新バージョンをダウンロードしてインストールします。所要時間はネットワーク接続によって異なります。ダウンロードサイズは約65 MBです。
ml_in: GitHub റിപ്പോസിറ്ററിയിൽ നിന്ന് ഏറ്റവും പുതിയ പതിപ്പ് ഡൗൺലോഡ് ചെയ്‌ത് ഇൻസ്റ്റാൾ ചെയ്യും. ഇതിന് എടുക്കുന്ന സമയം നിങ്ങളുടെ നെറ്റ്‌വർക്ക് കണക്ഷനെ ആശ്രയിച്ചിരിക്കുന്നു. ഏകദേശ ഡൗൺലോഡ് വലുപ്പം 65 MB ആണ്.
pl_pl: Pobierze i zainstaluje najnowszą wersję z repozytorium GitHub. Czas potrzebny zależy od połączenia sieciowego. Przybliżony rozmiar pobierania to 65 MB.
tr_tr: GitHub deposundan en son sürümü indirip yükleyecektir. İşlemin süresi ağ bağlantınıza bağlıdır. Yaklaşık indirme boyutu 65 MB’tır.
